Config/InformationRegisters/ОтветственныеИсполнителиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеИсполнителиПользователей</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ОтветственныеИсполнителиПользователей/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|  ЭтоАвторизованныйПользователь(Пользователь)
	|
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|    ЭтоАвторизованныйПользователь(Пользователь)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Ответственный.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
//  Организация - СправочникСсылка.Организации, Неопределено - Организация
//  Период - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.Сотрудники - Ответственный
Функция Ответственный(Пользователь, Организация = Неопределено, Период = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтветственныйИсполнитель.Организация,
	|	ОтветственныйИсполнитель.Сотрудник
	|ИЗ
	|	РегистрСведений.ОтветственныеИсполнителиПользователей.СрезПоследних(&Период, Пользователь = &Пользователь) КАК
	|		ОтветственныйИсполнитель
	|ГДЕ
	|	ОтветственныйИсполнитель.Организация = &Организация
	|	ИЛИ ОтветственныйИсполнитель.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ОтветственныйИсполнитель.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Если Пользователь = Пользователи.АвторизованныйПользователь() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сотрудник;
	КонецЕсли;
	
	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
